Revit 2027 API
BuiltInFailures.WallFailures.UnableToDeleteWallForPanel Property
 Unable to delete curtain panel wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToDeleteWallForPanel { get; }
Public Shared ReadOnly Property UnableToDeleteWallForPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToDeleteWallForPanel {
	FailureDefinitionId^ get ();
}
static member UnableToDeleteWallForPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace